app/View/Components/Loading/Loading.php

    public function render()
    {
        $logoBlack = Setting::where('id',13)->first();
        $logoWhite = Setting::where('id',14)->first();
---
select * from `settings` where `id` = 13 limit 1
select * from `settings` where `id` = 14 limit 1