app/View/Components/Home/Creative.php

select * from `cms_pages` where `status` = 'Active' and `section` = 'creative' order by `sort` asc limit 1
---
    public function render()
    {
        $data = CmsPage::where('status','Active')->where('section','creative')->orderBy('sort','asc')->first();