app/View/Components/Home/Partenrs.php

select * from `cms_pages` where (`page` = 'Home' and `section` = 'partenrs' and `status` = 'Active') limit 1
select * from `cms_pages` where (`page` = 'Home' and `section` = 'partenrs' and `status` = 'Active') limit 1 offset 1
select * from `cms_pages` where (`page` = 'Home' and `section` = 'partenrs' and `status` = 'Active')
select * from `cms_pages` where `status` = 'Active' and `section` = 'partenrs' order by `sort` asc
---
    public function render()
    {
        $cmsPage = CmsPage::where([
            ['page','Home'],
            ['section','partenrs'],
            ['status','Active']
        ])->first();

        $cmsPageLatest = CmsPage::where([
            ['page','Home'],
            ['section','partenrs'],
            ['status','Active']
        ])->skip(1)->first();

        $cmsPageParteners = CmsPage::where([
            ['page','Home'],
            ['section','partenrs'],
            ['status','Active']
        ])->get();
        $data = CmsPage::where('status','Active')->where('section','partenrs')->orderBy('sort','asc')->get();