app/View/Components/Home/RecentWork.php

    public function render()
    {
        $data = CmsPage::where('section','recent-works')->orderBy('sort','asc')->get();
---
select * from `cms_pages` where `section` = 'recent-works' order by `sort` asc