app/View/Components/Home/Slider.php

select * from `cms_pages` where `status` = 'Active' and `section` = 'sliders' order by `sort` asc
---
    public function render()
    {
        $data = CmsPage::where('status','Active')->where('section','sliders')->orderBy('sort','asc')->get();