app/View/Components/Frontend/Footer.php

select * from `pages` where `parent_id` is null and (`status` = 'Active' and `footer` = 'Active')
select * from `settings` where `id` = 14 limit 1
---
    public function render()
    {
        $pagesFooter = Page::whereNull('parent_id')->where([
            ['status','Active'],
            ['footer','Active'],
        ])->with('childes')->get();
        $logoBlack = Setting::where('id',14)->first();