app/View/Components/Frontend/Nav.php

select * from `pages` where `parent_id` is null and (`status` = 'Active' and `nave` = 'Active')
select * from `settings` where `key` = 'LogoWhite' limit 1
---
    public function render()
    {
        $pages = Page::whereNull('parent_id')->where([
            ['status','Active'],
            ['nave','Active'],
        ])->with('childes')->get();

        $model = Setting::where('key','LogoWhite')->first();